In [248]:
import numpy as np
import pandas as pd
import seaborn as sns
planets = sns.load_dataset('planets')
titanic = sns.load_dataset('titanic')

In [2]:
rng = np.random.RandomState(42)

In [3]:
def make_df(cols, ind):
    """Quickly make a DataFrame"""
    data = {c: [str(c) + str(i) for i in ind]
            for c in cols}
    return pd.DataFrame(data, ind)

In [4]:
pd.__version__

'0.23.4'

In [5]:
!python --version

Python 3.6.6

In [6]:
# pandas series object
data = pd.Series([0.25,0.5,0.75,1.0])
data

0    0.25
1    0.50
2    0.75
3    1.00
dtype: float64

In [7]:
print(data.values)
print(data.index)

[0.25 0.5  0.75 1.  ]
RangeIndex(start=0, stop=4, step=1)

In [8]:
data.index=[2,5,3,7] 
data

2    0.25
5    0.50
3    0.75
7    1.00
dtype: float64

In [9]:
data.index=['a','b','c','d'] 
data

a    0.25
b    0.50
c    0.75
d    1.00
dtype: float64

In [10]:
data['b']

0.5

In [11]:
# series from dictionary
population_dict = {'California': 38332521,
'Texas': 26448193,
'New York': 19651127,
'Florida': 19552860,
'Illinois': 12882135}
population = pd.Series(population_dict)
# By  default,  a  Series will  be  created  where  the  index  is  drawn  from  the  sorted  keys.
print(population)

California    38332521
Texas         26448193
New York      19651127
Florida       19552860
Illinois      12882135
dtype: int64

In [12]:
population.index

Index(['California', 'Texas', 'New York', 'Florida', 'Illinois'], dtype='object')

In [13]:
population['California']

38332521

In [14]:
population['California':'Illinois']

California    38332521
Texas         26448193
New York      19651127
Florida       19552860
Illinois      12882135
dtype: int64

In [15]:
# data can be a scalar, which is repeated to fill the specified index
pd.Series(5,index = [100,200,300])

100    5
200    5
300    5
dtype: int64

In [16]:
# index defaults to the sorted dictionary keys
pd.Series({2:'a', 1:'b', 3:'c'})

2    a
1    b
3    c
dtype: object

In [17]:
# The  Series  is  populated  only  with  the  explicitly  identified keys
pd.Series({2:'a', 1:'b', 3:'c'}, index=[3, 2])

3    c
2    a
dtype: object

In [18]:
# Pandas DataFrame Object
area_dict = {'California': 423967,
             'Texas': 695662, 
             'New York': 141297,
             'Florida': 170312, 
             'Illinois': 149995}
area = pd.Series(area_dict)
states = pd.DataFrame({'population':population,
                      'area':area})  # population is a series like area
print(states,'\n')
print(states.index,'\n')
print(states.values,'\n')
print(states.columns,'\n')

            population    area
California    38332521  423967
Texas         26448193  695662
New York      19651127  141297
Florida       19552860  170312
Illinois      12882135  149995

Index(['California', 'Texas', 'New York', 'Florida', 'Illinois'], dtype='object')

[[38332521   423967]
 [26448193   695662]
 [19651127   141297]
 [19552860   170312]
 [12882135   149995]]

Index(['population', 'area'], dtype='object')

In [19]:
#  In  a  two-dimensional  NumPy  array,
# data[0] will return the first row. 
# For a DataFrame, 
# data['col0'] will return the first column

print(states['area'])

California    423967
Texas         695662
New York      141297
Florida       170312
Illinois      149995
Name: area, dtype: int64

In [20]:
# Construction DataFrames Objects
# from single series object
pd.DataFrame(population,columns=['population'])

            population
California    38332521
Texas         26448193
New York      19651127
Florida       19552860
Illinois      12882135

In [21]:
# from a list of dictionaries
data = [{'a':i,'b':2*i} for i in range(3)]
print(data)
pd.DataFrame(data)

[{'a': 0, 'b': 0}, {'a': 1, 'b': 2}, {'a': 2, 'b': 4}]

   a  b
0  0  0
1  1  2
2  2  4

In [22]:
pd.DataFrame([{'a': 1, 'b': 2}, {'b': 3, 'c': 4}])

     a  b    c
0  1.0  2  NaN
1  NaN  3  4.0

In [23]:
# from a dictionary of series objects
pd.DataFrame({'population':population,
             'area':area})

            population    area
California    38332521  423967
Texas         26448193  695662
New York      19651127  141297
Florida       19552860  170312
Illinois      12882135  149995

In [24]:
# from two dimensional numpy array
pd.DataFrame(np.random.rand(3,2),
            columns = ['foo','bar'],
            index=['a','b','c'])

        foo       bar
a  0.933880  0.320300
b  0.606314  0.524389
c  0.369876  0.943486

In [25]:
# from a numpy structured array
a = np.zeros(2,dtype=[('A','i8'),('B','f8')])
pd.DataFrame(a)

   A    B
0  0  0.0
1  0  0.0

In [26]:
# Pandas Index Object
ind = pd.Index([2, 3, 5, 7, 11])
print(ind[1],'\n')
print(ind[::2],'\n')
print(ind.size,ind.shape,ind.dtype)

3

Int64Index([2, 5, 11], dtype='int64')

5 (5,) int64

In [27]:
#indexes are immutable
# ind[1] = 0 # gives error

In [28]:
indA = pd.Index([1, 3, 5, 7, 9])
indB = pd.Index([2, 3, 5, 7, 11])

# intersection
indA & indB # indA.intersection(indB)

Int64Index([3, 5, 7], dtype='int64')

In [29]:
# Union
indA | indB # indA.union(indB)

Int64Index([1, 2, 3, 5, 7, 9, 11], dtype='int64')

In [30]:
# symmetric difference
indA ^ indB # indA.symmetric_difference(ind_B)

Int64Index([1, 2, 9, 11], dtype='int64')

In [31]:
# Data selection in series
# series as dictionary
data = pd.Series([0.25, 0.5, 0.75, 1.0],
                 index=['a', 'b', 'c', 'd'])
data

a    0.25
b    0.50
c    0.75
d    1.00
dtype: float64

In [32]:
'a' in data

True

In [33]:
data.keys()

Index(['a', 'b', 'c', 'd'], dtype='object')

In [34]:
list(data.items())

[('a', 0.25), ('b', 0.5), ('c', 0.75), ('d', 1.0)]

In [35]:
# slicing
print(data['a':'c'],'\n') # 'c' is included
print(data[0:2]) # index at 2 place excluded

a    0.25
b    0.50
c    0.75
dtype: float64

a    0.25
b    0.50
dtype: float64

In [36]:
# masking
data[(data>0.3)&(data<0.8)]
data

a    0.25
b    0.50
c    0.75
d    1.00
dtype: float64

In [37]:
# fancy indexing
data[['a','d']]

a    0.25
d    1.00
dtype: float64

In [38]:
# indexers loc,iloc
data = pd.Series(['a', 'b', 'c','d'], 
                 index=[1, 3, 5, 7])
print(data.iloc[1:3],'\n') # implicit indexing, python style positional integer index starting with 0
print(data.loc[1:3]) # explicit indexing, includes end value

3    b
5    c
dtype: object

1    a
3    b
dtype: object

In [39]:
# Data selection in DataFrames
#dictionary style
area = pd.Series({'California': 423967, 
                   'Texas': 695662,
                   'New York': 141297, 
                   'Florida': 170312,
                   'Illinois': 149995})
pop = pd.Series({'California': 38332521, 
                 'Texas': 26448193,
                 'New York': 19651127, 
                 'Florida': 19552860,
                 'Illinois': 12882135})
data = pd.DataFrame({'area':area, 'pop':pop})
print(data,'\n')
print(data['area'])

              area       pop
California  423967  38332521
Texas       695662  26448193
New York    141297  19651127
Florida     170312  19552860
Illinois    149995  12882135

California    423967
Texas         695662
New York      141297
Florida       170312
Illinois      149995
Name: area, dtype: int64

In [40]:
data.area # attribute style access

California    423967
Texas         695662
New York      141297
Florida       170312
Illinois      149995
Name: area, dtype: int64

In [41]:
data.area is data['area']

True

In [42]:
data.pop is data['pop'] # attribute type access should be avoided

False

In [43]:
data['density']=data['pop']/data['area']
data

              area       pop     density
California  423967  38332521   90.413926
Texas       695662  26448193   38.018740
New York    141297  19651127  139.076746
Florida     170312  19552860  114.806121
Illinois    149995  12882135   85.883763

In [44]:
# DataFrame as 2D array
data.values

array([[4.23967000e+05, 3.83325210e+07, 9.04139261e+01],
       [6.95662000e+05, 2.64481930e+07, 3.80187404e+01],
       [1.41297000e+05, 1.96511270e+07, 1.39076746e+02],
       [1.70312000e+05, 1.95528600e+07, 1.14806121e+02],
       [1.49995000e+05, 1.28821350e+07, 8.58837628e+01]])

In [45]:
data.T # transpose

           California         Texas      New York       Florida      Illinois
area     4.239670e+05  6.956620e+05  1.412970e+05  1.703120e+05  1.499950e+05
pop      3.833252e+07  2.644819e+07  1.965113e+07  1.955286e+07  1.288214e+07
density  9.041393e+01  3.801874e+01  1.390767e+02  1.148061e+02  8.588376e+01

In [46]:
# data[0] # invalid
data.values[0]

array([4.23967000e+05, 3.83325210e+07, 9.04139261e+01])

In [47]:
data.iloc[0]

area       4.239670e+05
pop        3.833252e+07
density    9.041393e+01
Name: California, dtype: float64

In [48]:
data.loc['Florida']

area       1.703120e+05
pop        1.955286e+07
density    1.148061e+02
Name: Florida, dtype: float64

In [49]:
data.loc[:,'area']

California    423967
Texas         695662
New York      141297
Florida       170312
Illinois      149995
Name: area, dtype: int64

In [50]:
# masking and fancy indexing
data.loc[data['density'] > 100,['pop','density']]

               pop     density
New York  19651127  139.076746
Florida   19552860  114.806121

In [51]:
data.iloc[0,2] = 90 
data

              area       pop     density
California  423967  38332521   90.000000
Texas       695662  26448193   38.018740
New York    141297  19651127  139.076746
Florida     170312  19552860  114.806121
Illinois    149995  12882135   85.883763

In [52]:
# Operations on data
rng = np.random.RandomState(42)
ser = pd.Series(rng.randint(0,10,4))
ser

0    6
1    3
2    7
3    4
dtype: int64

In [53]:
df = pd.DataFrame(rng.randint(0,10,(3,4)),
                 columns = ['A','B','C','D'])
df

   A  B  C  D
0  6  9  2  6
1  7  4  3  7
2  7  2  5  4

In [54]:
np.exp(ser)

0     403.428793
1      20.085537
2    1096.633158
3      54.598150
dtype: float64

In [55]:
np.sin(df*np.pi/4)

          A             B         C             D
0 -1.000000  7.071068e-01  1.000000 -1.000000e+00
1 -0.707107  1.224647e-16  0.707107 -7.071068e-01
2 -0.707107  1.000000e+00 -0.707107  1.224647e-16

In [56]:
# index alignment in series
A = pd.Series([2, 4, 6], 
              index=[0, 1, 2])
B = pd.Series([1, 3, 5], 
              index=[1, 2, 3])

print(A + B,'\n')
print(A.index | B.index) # union

0    NaN
1    5.0
2    9.0
3    NaN
dtype: float64

Int64Index([0, 1, 2, 3], dtype='int64')

In [57]:
A.add(B,fill_value=0) # missing values in series will be treated as 0

0    2.0
1    5.0
2    9.0
3    5.0
dtype: float64

In [58]:
# index alignment in DataFrame
a = pd.DataFrame(rng.randint(0, 20, (2, 2)),
                 columns=list('AB'))
a

   A   B
0  1  11
1  5   1

In [59]:
b = pd.DataFrame(rng.randint(0,10,(3,3)),
                 columns= list('BAC'))
b

   B  A  C
0  4  0  9
1  5  8  0
2  9  2  6

In [60]:
a + b
# indices are aligned correctly irrespective of their order in the two objects,
# and indices in the result are sorted

      A     B   C
0   1.0  15.0 NaN
1  13.0   6.0 NaN
2   NaN   NaN NaN

In [61]:
print(a,'\n')
print(a.stack(),'\n')
fill = a.stack().mean()
print(fill,'\n')
print(a.add(b,fill_value=fill))

   A   B
0  1  11
1  5   1

0  A     1
   B    11
1  A     5
   B     1
dtype: int64

4.5

      A     B     C
0   1.0  15.0  13.5
1  13.0   6.0   4.5
2   6.5  13.5  10.5

In [62]:
# subtraction between a two-dimensional array and one of its rows is
# applied row-wise
a = rng.randint(10,size=(3,4))
print(a,'\n')
print(a - a[0])

[[3 8 2 4]
 [2 6 4 8]
 [6 1 3 8]]

[[ 0  0  0  0]
 [-1 -2  2  4]
 [ 3 -7  1  4]]

In [63]:
df = pd.DataFrame(a,columns=list('QRST'))
print(df,'\n')
print(df - df.iloc[0])

   Q  R  S  T
0  3  8  2  4
1  2  6  4  8
2  6  1  3  8

   Q  R  S  T
0  0  0  0  0
1 -1 -2  2  4
2  3 -7  1  4

In [64]:
# to operate column wise use axis
print(df.subtract(df.iloc[:,0],axis =0))

   Q  R  S  T
0  0  5 -1  1
1  0  4  2  6
2  0 -5 -3  2

In [65]:
halfrow = df.iloc[0,::-1]
print(halfrow)

T    4
S    2
R    8
Q    3
Name: 0, dtype: int64

In [66]:
# preservation  and  alignment  of  indices  and  columns  means  that  operations  on
# data in Pandas will always maintain the data context
df - halfrow

   Q  R  S  T
0  0  0  0  0
1 -1 -2  2  4
2  3 -7  1  4

In [67]:
# Handling missing Data
# None: Pythonic missing data
# None is  a  Python  object,  it  cannot  be
# used  in  any  arbitrary  NumPy/Pandas  array,  
# but  only  in  arrays  with  data  type 'object'

In [68]:
for dtype in ['object', 'int']:
    print("dtype =", dtype)
    %timeit np.arange(1E6, dtype=dtype).sum()
    print()

# Using sum() or min() across an array with a None value,
# generally gives an error.

dtype = object
57.1 ms  1.8 ms per loop (mean  std. dev. of 7 runs, 10 loops each)

dtype = int
2.29 ms  46 s per loop (mean  std. dev. of 7 runs, 100 loops each)

In [69]:
# NaN: Missing numerical data
vals2 = np.array([1, np.nan, 3, 4])
vals2.dtype

dtype('float64')

In [70]:
np.nansum(vals2), np.nanmin(vals2), np.nanmax(vals2)
# NaN  is  specifically  a  floating-point  value;  
# There  is  no  equivalent NaN value for integers, strings, or other types.

(8.0, 1.0, 4.0)

In [71]:
# detecting null values
data = pd.Series([1,np.nan,'hello',None])
print(data,'\n')
print(data.isnull(),'\n')
print(data.notnull(),'\n')
print(data[data.notnull()]) # using boolean mask

0        1
1      NaN
2    hello
3     None
dtype: object

0    False
1     True
2    False
3     True
dtype: bool

0     True
1    False
2     True
3    False
dtype: bool

0        1
2    hello
dtype: object

In [72]:
# dropping null values
data.dropna()

0        1
2    hello
dtype: object

In [73]:
df=pd.DataFrame([[1,np.nan,2],
                 [2,3,5],
                 [np.nan,4,6]])
df

     0    1  2
0  1.0  NaN  2
1  2.0  3.0  5
2  NaN  4.0  6

In [74]:
df.dropna(axis = 'index',subset = [0])
# subset : array-like, optional
#     Labels along other axis to consider, e.g. if you are dropping rows
#     these would be a list of columns to include.

     0    1  2
0  1.0  NaN  2
1  2.0  3.0  5

In [75]:
df.dropna() # drops all rows in which any null value is preset

     0    1  2
1  2.0  3.0  5

In [76]:
df.dropna(axis='columns')

   2
0  2
1  5
2  6

In [77]:
df[3] = np.nan # making whole column as NaN
df

     0    1  2   3
0  1.0  NaN  2 NaN
1  2.0  3.0  5 NaN
2  NaN  4.0  6 NaN

In [78]:
df.dropna(axis='columns',how='all')

     0    1  2
0  1.0  NaN  2
1  2.0  3.0  5
2  NaN  4.0  6

In [79]:
df.dropna(axis='rows',thresh=3)
# thresh parameter lets you specify a minimum number
# of non-null values for the row/column to be kept

     0    1  2   3
1  2.0  3.0  5 NaN

In [80]:
# filling null values
data = pd.Series([1, np.nan, 2, None, 3], 
                 index=list('abcde'))
data

a    1.0
b    NaN
c    2.0
d    NaN
e    3.0
dtype: float64

In [81]:
data.fillna(0) # fill missing values with 0

a    1.0
b    0.0
c    2.0
d    0.0
e    3.0
dtype: float64

In [82]:
data.fillna(method='ffill')
# pad / ffill: propagate last valid observation forward to next valid
# backfill / bfill: use NEXT valid observation to fill gap

a    1.0
b    1.0
c    2.0
d    2.0
e    3.0
dtype: float64

In [83]:
print(df,'\n')
print(df.fillna(method='ffill',axis='columns'))

     0    1  2   3
0  1.0  NaN  2 NaN
1  2.0  3.0  5 NaN
2  NaN  4.0  6 NaN

     0    1    2    3
0  1.0  1.0  2.0  2.0
1  2.0  3.0  5.0  5.0
2  NaN  4.0  6.0  6.0

In [84]:
# Hierarchical Indexing
index = [('California', 2000), ('California', 2010),
    ('New York', 2000), ('New York', 2010),
    ('Texas', 2000), ('Texas', 2010)]

In [85]:
populations = [33871648, 37253956,
               18976457, 19378102,
               20851820, 25145561]

In [86]:
# series 
# not the best way
pop=pd.Series(populations,index=index)
pop

(California, 2000)    33871648
(California, 2010)    37253956
(New York, 2000)      18976457
(New York, 2010)      19378102
(Texas, 2000)         20851820
(Texas, 2010)         25145561
dtype: int64

In [87]:
# slicing 
pop[('California',2010):('Texas',2000)]

(California, 2010)    37253956
(New York, 2000)      18976457
(New York, 2010)      19378102
(Texas, 2000)         20851820
dtype: int64

In [88]:
# complex operations
# selecting all values for 2010
pop[[i for i in pop.index if i[1]== 2010]]

(California, 2010)    37253956
(New York, 2010)      19378102
(Texas, 2010)         25145561
dtype: int64

In [89]:
# Pandas # Better Way
index = pd.MultiIndex.from_tuples(index) # or for multidim array : from_arrays 
index

MultiIndex(levels=[['California', 'New York', 'Texas'], [2000, 2010]],
           labels=[[0, 0, 1, 1, 2, 2], [0, 1, 0, 1, 0, 1]])

In [90]:
pd.MultiIndex.from_product([['a','b'],[1,2]]) # cartesian product

MultiIndex(levels=[['a', 'b'], [1, 2]],
           labels=[[0, 0, 1, 1], [0, 1, 0, 1]])

In [91]:
pop = pop.reindex(index)
pop

California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

In [92]:
pop[:,2010]

California    37253956
New York      19378102
Texas         25145561
dtype: int64

In [93]:
# names for multilevel index
pop.index.names = ['state','year']
pop

state       year
California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

In [94]:
# MultiIndex as extra dimension
pop_df = pop.unstack()
pop_df

year            2000      2010
state
California  33871648  37253956
New York    18976457  19378102
Texas       20851820  25145561

In [95]:
pop_df.stack()

state       year
California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

In [96]:
# add another column
pop_df=pd.DataFrame({'total':pop,
                    'under18':[9267089, 9284094,
                               4687374, 4318033,
                               5906301, 6879014]})
pop_df

                    total  under18
state      year
California 2000  33871648  9267089
           2010  37253956  9284094
New York   2000  18976457  4687374
           2010  19378102  4318033
Texas      2000  20851820  5906301
           2010  25145561  6879014

In [97]:
# fraction of people under 18 by year
pop_df['under18']/pop_df['total']

state       year
California  2000    0.273594
            2010    0.249211
New York    2000    0.247010
            2010    0.222831
Texas       2000    0.283251
            2010    0.273568
dtype: float64

In [98]:
# MultiIndex for columns
index = pd.MultiIndex.from_product([[2013,2014],[1,2]],
                                  names = ['year','visit'])
columns = pd.MultiIndex.from_product([['Bob','Guido','Sue'],['HR','Temp']],
                                    names = ['subject','type'])
print(index,'\n')
print(columns)

MultiIndex(levels=[[2013, 2014], [1, 2]],
           labels=[[0, 0, 1, 1], [0, 1, 0, 1]],
           names=['year', 'visit'])

MultiIndex(levels=[['Bob', 'Guido', 'Sue'], ['HR', 'Temp']],
           labels=[[0, 0, 1, 1, 2, 2], [0, 1, 0, 1, 0, 1]],
           names=['subject', 'type'])

In [99]:
#mock data
data = np.round(np.random.randn(4,6),1)
data[:,::2]*=10
data += 37
data

array([[49. , 37.5, 35. , 36.6, 53. , 36. ],
       [35. , 38. , 29. , 38.6, 42. , 38.5],
       [48. , 36.8, 43. , 36.6, 33. , 37.4],
       [22. , 37.8, 55. , 37.9, 17. , 38.1]])

In [100]:
# create a dataframe
health_data = pd.DataFrame(data,index=index,columns=columns)
health_data # 4 dimensional data

subject      Bob       Guido         Sue
type          HR  Temp    HR  Temp    HR  Temp
year visit
2013 1      49.0  37.5  35.0  36.6  53.0  36.0
     2      35.0  38.0  29.0  38.6  42.0  38.5
2014 1      48.0  36.8  43.0  36.6  33.0  37.4
     2      22.0  37.8  55.0  37.9  17.0  38.1

In [101]:
# health_data.unstack(level = [1,0]).index # topic not clear

In [102]:
# Indexing and slicing
pop

state       year
California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

In [103]:
print(pop['California',2000],'\n')
print(pop['California'])  # partial indexing only if MultiIndex is sorted

33871648

year
2000    33871648
2010    37253956
dtype: int64

In [104]:
pop[:,2000]  # to be used with sorted indices only

state
California    33871648
New York      18976457
Texas         20851820
dtype: int64

In [105]:
health_data

subject      Bob       Guido         Sue
type          HR  Temp    HR  Temp    HR  Temp
year visit
2013 1      49.0  37.5  35.0  36.6  53.0  36.0
     2      35.0  38.0  29.0  38.6  42.0  38.5
2014 1      48.0  36.8  43.0  36.6  33.0  37.4
     2      22.0  37.8  55.0  37.9  17.0  38.1

In [106]:
health_data['Guido','HR']

year  visit
2013  1        35.0
      2        29.0
2014  1        43.0
      2        55.0
Name: (Guido, HR), dtype: float64

In [107]:

health_data.loc[:,['Bob','HR']] # returns dataframe

subject      Bob
type          HR  Temp
year visit
2013 1      49.0  37.5
     2      35.0  38.0
2014 1      48.0  36.8
     2      22.0  37.8

In [108]:
health_data.loc[:,('Bob','HR')] # returns series

year  visit
2013  1        49.0
      2        35.0
2014  1        48.0
      2        22.0
Name: (Bob, HR), dtype: float64

In [109]:
# health_data.loc[(:, 1), (:, 'HR')] # error while slicing within tuples

In [110]:
# using IndexSlice objects
idx = pd.IndexSlice
health_data.loc[idx[:,1],idx[:,'HR']]

subject      Bob Guido   Sue
type          HR    HR    HR
year visit
2013 1      49.0  35.0  53.0
2014 1      48.0  43.0  33.0

In [111]:
# Rearranging multi index
# Many of the MultiIndex slicing operations will fail if the index is not sorted

In [112]:
index = pd.MultiIndex.from_product([[2,1],
                                    ['a', 'c', 'b']])
data = pd.Series(np.random.rand(6), 
                 index=index)
data.index.names = ['int', 'char']
data

int  char
2    a       0.943053
     c       0.784688
     b       0.962190
1    a       0.611513
     c       0.453934
     b       0.113372
dtype: float64

In [113]:
data.sort_index()

int  char
1    a       0.611513
     b       0.113372
     c       0.453934
2    a       0.943053
     b       0.962190
     c       0.784688
dtype: float64

In [114]:
# stack, unstack
pop

state       year
California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

In [115]:
pop.unstack(level=0)

state  California  New York     Texas
year
2000     33871648  18976457  20851820
2010     37253956  19378102  25145561

In [116]:
pop.unstack(level=1)

year            2000      2010
state
California  33871648  37253956
New York    18976457  19378102
Texas       20851820  25145561

In [117]:
pop.unstack().stack()

state       year
California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

In [118]:
# Index setting and resetting
# rearrange hierarchical data to turn the index labels into columns
pop_flat = pop.reset_index(name = 'population') # name: The name to use for the column containing the original Series values
pop_flat

        state  year  population
0  California  2000    33871648
1  California  2010    37253956
2    New York  2000    18976457
3    New York  2010    19378102
4       Texas  2000    20851820
5       Texas  2010    25145561

In [119]:
# multiindexing
pop_flat.set_index(['state','year'])

                 population
state      year
California 2000    33871648
           2010    37253956
New York   2000    18976457
           2010    19378102
Texas      2000    20851820
           2010    25145561

In [120]:
# Data Aggregations on Multi Indices
health_data

subject      Bob       Guido         Sue
type          HR  Temp    HR  Temp    HR  Temp
year visit
2013 1      49.0  37.5  35.0  36.6  53.0  36.0
     2      35.0  38.0  29.0  38.6  42.0  38.5
2014 1      48.0  36.8  43.0  36.6  33.0  37.4
     2      22.0  37.8  55.0  37.9  17.0  38.1

In [121]:
data_mean = health_data.mean(level='year')
data_mean

subject   Bob        Guido          Sue
type       HR   Temp    HR   Temp    HR   Temp
year
2013     42.0  37.75  32.0  37.60  47.5  37.25
2014     35.0  37.30  49.0  37.25  25.0  37.75

In [122]:
## Advance topic: pd.Panel and pd.Panel4D (3d and 4d generalization of 1d series and 2d dataframe structures)

In [123]:
# Combining Datasets
make_df('ABC',range(3))

    A   B   C
0  A0  B0  C0
1  A1  B1  C1
2  A2  B2  C2

In [124]:
# concatenation

ser1 = pd.Series(['A', 'B', 'C'], 
                 index=[1, 2, 3])
ser2 = pd.Series(['D', 'E', 'F'], 
                 index=[4, 5, 6])
pd.concat([ser1, ser2])

1    A
2    B
3    C
4    D
5    E
6    F
dtype: object

In [125]:
df1 = make_df('AB', [1, 2])
df2 = make_df('AB', [3, 4])
print(df1,'\n') 
print(df2,'\n')
print(pd.concat([df1, df2])) # default row wise

    A   B
1  A1  B1
2  A2  B2

    A   B
3  A3  B3
4  A4  B4

    A   B
1  A1  B1
2  A2  B2
3  A3  B3
4  A4  B4

In [126]:
df3 = make_df('AB', [0, 1])
df4 = make_df('CD', [0, 1])
print(pd.concat([df3, df4],axis ='columns')) # axis = 1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1

In [127]:
# if indices are same then they are duplicated
print(pd.concat([df1,df1]))

    A   B
1  A1  B1
2  A2  B2
1  A1  B1
2  A2  B2

In [128]:
# catching repeated indices
try:
    pd.concat([df1,df1],verify_integrity=True)
except ValueError as e:
    print('ValueError:',e)

ValueError: Indexes have overlapping values: Int64Index([1, 2], dtype='int64')

In [129]:
# ignoring index
print(pd.concat([df1,df1],ignore_index=True))

    A   B
0  A1  B1
1  A2  B2
2  A1  B1
3  A2  B2

In [130]:
# using multiindexing in concat
print(pd.concat([df1,df1],keys=['first','second']))

           A   B
first  1  A1  B1
       2  A2  B2
second 1  A1  B1
       2  A2  B2

In [131]:
# concat with joins
df5 = make_df('ABC', [1, 2])
df6 = make_df('BCD', [3, 4])
print(df5,'\n')
print(df6,'\n')
print(pd.concat([df5, df6],sort=False)) # for deprication warning

    A   B   C
1  A1  B1  C1
2  A2  B2  C2

    B   C   D
3  B3  C3  D3
4  B4  C4  D4

     A   B   C    D
1   A1  B1  C1  NaN
2   A2  B2  C2  NaN
3  NaN  B3  C3   D3
4  NaN  B4  C4   D4

In [133]:
print(pd.concat([df5,df6],join='inner'))

    B   C
1  B1  C1
2  B2  C2
3  B3  C3
4  B4  C4

In [135]:
print(df1);print(df2);print(df1.append(df2))

    A   B
1  A1  B1
2  A2  B2
    A   B
3  A3  B3
4  A4  B4
    A   B
1  A1  B1
2  A2  B2
3  A3  B3
4  A4  B4

In [ ]:
# unlike  the  append()  and  extend()  methods  of  Python  lists,  the
# append() method in Pandas does not modify the original objectinstead, it creates a
# new  object  with  the  combined  data.  It  also  is  not  a  very  efficient  method,  because  it
# involves  creation  of  a  new  index  and  data  buffer.

In [138]:
df1 = pd.DataFrame({'employee': ['Bob', 'Jake', 'Lisa', 'Sue'],
  'group': ['Accounting', 'Engineering', 'Engineering', 'HR']})
df2 = pd.DataFrame({'employee': ['Lisa', 'Bob', 'Jake', 'Sue'],
                    'hire_date': [2004, 2008, 2012, 2014]})
print(df1,'\n\n');print(df2);

  employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR


  employee  hire_date
0     Lisa       2004
1      Bob       2008
2     Jake       2012
3      Sue       2014

In [140]:
# One-to-one joins
df3 = pd.merge(df1,df2)
df3

  employee        group  hire_date
0      Bob   Accounting       2008
1     Jake  Engineering       2012
2     Lisa  Engineering       2004
3      Sue           HR       2014

In [142]:
df4 = pd.DataFrame({'group': ['Accounting', 'Engineering', 'HR'],
                    'supervisor': ['Carly', 'Guido', 'Steve']})
df4

         group supervisor
0   Accounting      Carly
1  Engineering      Guido
2           HR      Steve

In [143]:
# many to one joins
pd.merge(df3,df4)

  employee        group  hire_date supervisor
0      Bob   Accounting       2008      Carly
1     Jake  Engineering       2012      Guido
2     Lisa  Engineering       2004      Guido
3      Sue           HR       2014      Steve

In [145]:
df5 = pd.DataFrame({'group': ['Accounting', 'Accounting','Engineering', 'Engineering', 'HR', 'HR'],
                    'skills': ['math', 'spreadsheets', 'coding', 'linux','spreadsheets', 'organization']})
df5

         group        skills
0   Accounting          math
1   Accounting  spreadsheets
2  Engineering        coding
3  Engineering         linux
4           HR  spreadsheets
5           HR  organization

In [146]:
#many to many join
pd.merge(df4,df5)

         group supervisor        skills
0   Accounting      Carly          math
1   Accounting      Carly  spreadsheets
2  Engineering      Guido        coding
3  Engineering      Guido         linux
4           HR      Steve  spreadsheets
5           HR      Steve  organization

In [148]:
# using on keyword
print(df1,'\n\n')
print(df2,'\n\n')
print(pd.merge(df1,df2,on='employee'))
# both dataframes must have the specified column name

  employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR


  employee  hire_date
0     Lisa       2004
1      Bob       2008
2     Jake       2012
3      Sue       2014


  employee        group  hire_date
0      Bob   Accounting       2008
1     Jake  Engineering       2012
2     Lisa  Engineering       2004
3      Sue           HR       2014

In [149]:
# left_on and right_on

df3 = pd.DataFrame({'name': ['Bob', 'Jake', 'Lisa', 'Sue'],
                    'salary': [70000, 80000, 120000, 90000]})
print(df1,'\n\n'); 
print(df3,'\n\n');
print(pd.merge(df1, df3, left_on="employee", right_on="name"))

  employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR


   name  salary
0   Bob   70000
1  Jake   80000
2  Lisa  120000
3   Sue   90000


  employee        group  name  salary
0      Bob   Accounting   Bob   70000
1     Jake  Engineering  Jake   80000
2     Lisa  Engineering  Lisa  120000
3      Sue           HR   Sue   90000

In [150]:
pd.merge(df1, df3, left_on="employee", right_on="name").drop('name',axis=1)

  employee        group  salary
0      Bob   Accounting   70000
1     Jake  Engineering   80000
2     Lisa  Engineering  120000
3      Sue           HR   90000

In [153]:
# merge on index
df1a = df1.set_index('employee')
df2a = df2.set_index('employee')
print(df1a,'\n\n')
print(df2a)
pd.merge(df1a,df2a,left_index=True,right_index=True)

                group
employee
Bob        Accounting
Jake      Engineering
Lisa      Engineering
Sue                HR


          hire_date
employee
Lisa           2004
Bob            2008
Jake           2012
Sue            2014

                group  hire_date
employee
Bob        Accounting       2008
Jake      Engineering       2012
Lisa      Engineering       2004
Sue                HR       2014

In [154]:
# join() method defaults to indices
df1a.join(df2a)

                group  hire_date
employee
Bob        Accounting       2008
Jake      Engineering       2012
Lisa      Engineering       2004
Sue                HR       2014

In [165]:
print(df1a,'\n\n')
print(df3,'\n\n')
print(pd.merge(df1a,df3,left_index=True, right_on='name'))

                group
employee
Bob        Accounting
Jake      Engineering
Lisa      Engineering
Sue                HR


   name  salary
0   Bob   70000
1  Jake   80000
2  Lisa  120000
3   Sue   90000


         group  name  salary
0   Accounting   Bob   70000
1  Engineering  Jake   80000
2  Engineering  Lisa  120000
3           HR   Sue   90000

In [167]:
df6 = pd.DataFrame({'name': ['Peter', 'Paul', 'Mary'],
                    'food': ['fish', 'beans', 'bread']},
                   columns=['name', 'food'])
df7 = pd.DataFrame({'name': ['Mary', 'Joseph'],
                    'drink': ['wine', 'beer']},
                   columns=['name', 'drink'])

print(df6,'\n\n')
print(df7,'\n\n')
pd.merge(df6,df7) # default inner join

    name   food
0  Peter   fish
1   Paul  beans
2   Mary  bread


     name drink
0    Mary  wine
1  Joseph  beer

   name   food drink
0  Mary  bread  wine

In [168]:
pd.merge(df6,df7,how='outer')

     name   food drink
0   Peter   fish   NaN
1    Paul  beans   NaN
2    Mary  bread  wine
3  Joseph    NaN  beer

In [170]:
df8 = pd.DataFrame({'name': ['Bob', 'Jake', 'Lisa', 'Sue'],
                    'rank': [1, 2, 3, 4]})
df9 = pd.DataFrame({'name': ['Bob', 'Jake', 'Lisa', 'Sue'],
                    'rank': [3, 1, 4, 2]})

pd.merge(df8,df9, on='name') # overlapping column names

   name  rank_x  rank_y
0   Bob       1       3
1  Jake       2       1
2  Lisa       3       4
3   Sue       4       2

In [173]:
pd.merge(df8,df9, on='name',suffixes= ["_L","_R"])

   name  rank_L  rank_R
0   Bob       1       3
1  Jake       2       1
2  Lisa       3       4
3   Sue       4       2

In [176]:
# !curl -O https://raw.githubusercontent.com/jakevdp/data-USstates/master/state-population.csv
# !curl -O https://raw.githubusercontent.com/jakevdp/data-USstates/master/state-areas.csv
# !curl -O https://raw.githubusercontent.com/jakevdp/data-USstates/master/state-abbrevs.csv

  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current
                                 Dload  Upload   Total   Spent    Left  Speed
100 57935  100 57935    0     0  50378      0  0:00:01  0:00:01 --:--:-- 50378
  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current
                                 Dload  Upload   Total   Spent    Left  Speed
100   835  100   835    0     0   1007      0 --:--:-- --:--:-- --:--:--  1006
  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current
                                 Dload  Upload   Total   Spent    Left  Speed
100   872  100   872    0     0   1008      0 --:--:-- --:--:-- --:--:--  1006

In [178]:
pop = pd.read_csv('state-population.csv')
areas = pd.read_csv('state-areas.csv')
abbrevas = pd.read_csv('state-abbrevs.csv')
print(pop.head(),'\n\n')
print(areas.head(),'\n\n')
print(abbrevas.head())

  state/region     ages  year  population
0           AL  under18  2012   1117489.0
1           AL    total  2012   4817528.0
2           AL  under18  2010   1130966.0
3           AL    total  2010   4785570.0
4           AL  under18  2011   1125763.0


        state  area (sq. mi)
0     Alabama          52423
1      Alaska         656425
2     Arizona         114006
3    Arkansas          53182
4  California         163707


        state abbreviation
0     Alabama           AL
1      Alaska           AK
2     Arizona           AZ
3    Arkansas           AR
4  California           CA

In [193]:
merged =pd.merge(pop,abbrevas,how = 'outer',left_on='state/region',right_on='abbreviation').drop('abbreviation',1)
merged.head()

  state/region     ages  year  population    state
0           AL  under18  2012   1117489.0  Alabama
1           AL    total  2012   4817528.0  Alabama
2           AL  under18  2010   1130966.0  Alabama
3           AL    total  2010   4785570.0  Alabama
4           AL  under18  2011   1125763.0  Alabama

In [194]:
merged.isnull().any()

state/region    False
ages            False
year            False
population       True
state            True
dtype: bool

In [195]:
merged[merged['population'].isnull()].head()

     state/region     ages  year  population state
2448           PR  under18  1990         NaN   NaN
2449           PR    total  1990         NaN   NaN
2450           PR    total  1991         NaN   NaN
2451           PR  under18  1991         NaN   NaN
2452           PR    total  1993         NaN   NaN

In [196]:
merged.loc[merged['state'].isnull(),'state/region'].unique()

array(['PR', 'USA'], dtype=object)

In [197]:
merged.loc[merged['state/region']=='PR','state'] = 'Puerto Rico'
merged.loc[merged['state/region']=='USA','state'] = 'United States'
merged.isnull().any()

state/region    False
ages            False
year            False
population       True
state           False
dtype: bool

In [198]:
final = pd.merge(merged,areas, on='state',how='left')
final.head()

  state/region     ages  year  population    state  area (sq. mi)
0           AL  under18  2012   1117489.0  Alabama        52423.0
1           AL    total  2012   4817528.0  Alabama        52423.0
2           AL  under18  2010   1130966.0  Alabama        52423.0
3           AL    total  2010   4785570.0  Alabama        52423.0
4           AL  under18  2011   1125763.0  Alabama        52423.0

In [200]:
final.isnull().any()

state/region     False
ages             False
year             False
population        True
state            False
area (sq. mi)     True
dtype: bool

In [201]:
final['state'][final['area (sq. mi)'].isnull()].unique()

array(['United States'], dtype=object)

In [204]:
final.dropna(inplace=True)
final.head()

  state/region     ages  year  population    state  area (sq. mi)
0           AL  under18  2012   1117489.0  Alabama        52423.0
1           AL    total  2012   4817528.0  Alabama        52423.0
2           AL  under18  2010   1130966.0  Alabama        52423.0
3           AL    total  2010   4785570.0  Alabama        52423.0
4           AL  under18  2011   1125763.0  Alabama        52423.0

In [206]:
data2010 = final.query("year==2010 & ages == 'total'")
data2010.head()

    state/region   ages  year  population       state  area (sq. mi)
3             AL  total  2010   4785570.0     Alabama        52423.0
91            AK  total  2010    713868.0      Alaska       656425.0
101           AZ  total  2010   6408790.0     Arizona       114006.0
189           AR  total  2010   2922280.0    Arkansas        53182.0
197           CA  total  2010  37333601.0  California       163707.0

In [207]:
data2010.set_index('state',inplace=True)
density = data2010['population']/data2010['area (sq. mi)']

In [208]:
density.sort_values(ascending=False,inplace=True)
density.head()

state
District of Columbia    8898.897059
Puerto Rico             1058.665149
New Jersey              1009.253268
Rhode Island             681.339159
Connecticut              645.600649
dtype: float64

In [209]:
density.tail()

state
South Dakota    10.583512
North Dakota     9.537565
Montana          6.736171
Wyoming          5.768079
Alaska           1.087509
dtype: float64

In [ ]:
# Aggregation and Grouping

In [211]:
planets.head()

            method  number  orbital_period   mass  distance  year
0  Radial Velocity       1         269.300   7.10     77.40  2006
1  Radial Velocity       1         874.774   2.21     56.95  2008
2  Radial Velocity       1         763.000   2.60     19.84  2011
3  Radial Velocity       1         326.030  19.40    110.62  2007
4  Radial Velocity       1         516.220  10.50    119.47  2009

In [212]:
df = pd.DataFrame({'key': ['A', 'B', 'C', 'A', 'B', 'C'],
                   'data': range(6)}, 
                  columns=['key', 'data'])
df

  key  data
0   A     0
1   B     1
2   C     2
3   A     3
4   B     4
5   C     5

In [213]:
df.groupby('key') # groupby object

In [214]:
df.groupby('key').sum()

     data
key
A       3
B       5
C       7

In [215]:
planets.groupby('method')

In [216]:
planets.groupby('method')['orbital_period'] # col indexing

In [217]:
planets.groupby('method')['orbital_period'].median()

method
Astrometry                         631.180000
Eclipse Timing Variations         4343.500000
Imaging                          27500.000000
Microlensing                      3300.000000
Orbital Brightness Modulation        0.342887
Pulsar Timing                       66.541900
Pulsation Timing Variations       1170.000000
Radial Velocity                    360.200000
Transit                              5.714932
Transit Timing Variations           57.011000
Name: orbital_period, dtype: float64

In [224]:
# iteration over groups
for (method,group) in planets.groupby('method'):
#     print(method)
#     print(group)
    print("{0:30s} shape = {1}".format(method,group.shape))

Astrometry
Astrometry                     shape = (2, 6)
Eclipse Timing Variations
Eclipse Timing Variations      shape = (9, 6)
Imaging
Imaging                        shape = (38, 6)
Microlensing
Microlensing                   shape = (23, 6)
Orbital Brightness Modulation
Orbital Brightness Modulation  shape = (3, 6)
Pulsar Timing
Pulsar Timing                  shape = (5, 6)
Pulsation Timing Variations
Pulsation Timing Variations    shape = (1, 6)
Radial Velocity
Radial Velocity                shape = (553, 6)
Transit
Transit                        shape = (397, 6)
Transit Timing Variations
Transit Timing Variations      shape = (4, 6)

In [229]:
planets.groupby('method')['year'].describe().unstack()

       method
count  Astrometry                          2.000000
       Eclipse Timing Variations           9.000000
       Imaging                            38.000000
       Microlensing                       23.000000
       Orbital Brightness Modulation       3.000000
       Pulsar Timing                       5.000000
       Pulsation Timing Variations         1.000000
       Radial Velocity                   553.000000
       Transit                           397.000000
       Transit Timing Variations           4.000000
mean   Astrometry                       2011.500000
       Eclipse Timing Variations        2010.000000
       Imaging                          2009.131579
       Microlensing                     2009.782609
       Orbital Brightness Modulation    2011.666667
       Pulsar Timing                    1998.400000
       Pulsation Timing Variations      2007.000000
       Radial Velocity                  2007.518987
       Transit                          2011.236776
       Transit Timing Variations        2012.500000
std    Astrometry                          2.121320
       Eclipse Timing Variations           1.414214
       Imaging                             2.781901
       Microlensing                        2.859697
       Orbital Brightness Modulation       1.154701
       Pulsar Timing                       8.384510
       Pulsation Timing Variations              NaN
       Radial Velocity                     4.249052
       Transit                             2.077867
       Transit Timing Variations           1.290994
                                           ...
50%    Astrometry                       2011.500000
       Eclipse Timing Variations        2010.000000
       Imaging                          2009.000000
       Microlensing                     2010.000000
       Orbital Brightness Modulation    2011.000000
       Pulsar Timing                    1994.000000
       Pulsation Timing Variations      2007.000000
       Radial Velocity                  2009.000000
       Transit                          2012.000000
       Transit Timing Variations        2012.500000
75%    Astrometry                       2012.250000
       Eclipse Timing Variations        2011.000000
       Imaging                          2011.000000
       Microlensing                     2012.000000
       Orbital Brightness Modulation    2012.000000
       Pulsar Timing                    2003.000000
       Pulsation Timing Variations      2007.000000
       Radial Velocity                  2011.000000
       Transit                          2013.000000
       Transit Timing Variations        2013.250000
max    Astrometry                       2013.000000
       Eclipse Timing Variations        2012.000000
       Imaging                          2013.000000
       Microlensing                     2013.000000
       Orbital Brightness Modulation    2013.000000
       Pulsar Timing                    2011.000000
       Pulsation Timing Variations      2007.000000
       Radial Velocity                  2014.000000
       Transit                          2014.000000
       Transit Timing Variations        2014.000000
Length: 80, dtype: float64

In [230]:
#aggregate
rng = np.random.RandomState(0)
df = pd.DataFrame({'key': ['A', 'B', 'C', 'A', 'B', 'C'],
                   'data1': range(6),
                   'data2': rng.randint(0, 10, 6)},
                  columns = ['key', 'data1', 'data2'])
df

  key  data1  data2
0   A      0      5
1   B      1      0
2   C      2      3
3   A      3      3
4   B      4      7
5   C      5      9

In [239]:
df.groupby('key').aggregate(['min',np.median,max])

        key  data1  data2
min       A    0.0    0.0
max       C    5.0    9.0
median  NaN    2.5    4.0

In [232]:
df.groupby('key').aggregate({'data1':'min',
                            'data2':'max'})

     data1  data2
key
A        0      5
B        1      7
C        2      9

In [234]:
# filtering
def filter_func(x):
    return x['data2'].std() > 4

print(df,'\n\n')
print(df.groupby('key').std())
df.groupby('key').filter(filter_func)

  key  data1  data2
0   A      0      5
1   B      1      0
2   C      2      3
3   A      3      3
4   B      4      7
5   C      5      9


       data1     data2
key
A    2.12132  1.414214
B    2.12132  4.949747
C    2.12132  4.242641

  key  data1  data2
1   B      1      0
2   C      2      3
4   B      4      7
5   C      5      9

In [235]:
# transformation
df.groupby('key').transform(lambda x:x - x.mean())

   data1  data2
0   -1.5    1.0
1   -1.5   -3.5
2   -1.5   -3.0
3    1.5   -1.0
4    1.5    3.5
5    1.5    3.0

In [236]:
# apply() method
def norm_by_data2(x):
    # x is a dataframe of group values
    x['data1'] /= x['data2'].sum()
    return x

print(df)
df.groupby('key').apply(norm_by_data2)

  key  data1  data2
0   A      0      5
1   B      1      0
2   C      2      3
3   A      3      3
4   B      4      7
5   C      5      9

  key     data1  data2
0   A  0.000000      5
1   B  0.142857      0
2   C  0.166667      3
3   A  0.375000      3
4   B  0.571429      7
5   C  0.416667      9

In [241]:
# The  key  can  be  any  series  or  list
# with a length matching that of the DataFrame
L = [0,1,0,1,2,0]
print(df)
df.groupby(L).sum()

  key  data1  data2
0   A      0      5
1   B      1      0
2   C      2      3
3   A      3      3
4   B      4      7
5   C      5      9

   data1  data2
0      7     17
1      4      3
2      4      7

In [244]:
# using dictionary that maps index values to the group keys
df2 = df.set_index('key')
mapping = {'A':'vowel','B':'consonant','C':'consonant'}
print(df2)
df2.groupby(mapping).sum()

     data1  data2
key
A        0      5
B        1      0
C        2      3
A        3      3
B        4      7
C        5      9

           data1  data2
consonant     12     19
vowel          3      8

In [245]:
# python function
df2.groupby(str.lower).mean()

   data1  data2
a    1.5    4.0
b    2.5    3.5
c    3.5    6.0

In [246]:
# multi- index
df2.groupby([str.lower,mapping]).mean()

             data1  data2
a vowel        1.5    4.0
b consonant    2.5    3.5
c consonant    3.5    6.0

In [247]:
# count discovered planets by method and by decade
decade = 10*(planets['year']//10)
decade = decade.astype(str) + 's'
decade.name = 'decade'
planets.groupby(['method',decade])['number'].sum().unstack().fillna(0)

decade                         1980s  1990s  2000s  2010s
method
Astrometry                       0.0    0.0    0.0    2.0
Eclipse Timing Variations        0.0    0.0    5.0   10.0
Imaging                          0.0    0.0   29.0   21.0
Microlensing                     0.0    0.0   12.0   15.0
Orbital Brightness Modulation    0.0    0.0    0.0    5.0
Pulsar Timing                    0.0    9.0    1.0    1.0
Pulsation Timing Variations      0.0    0.0    1.0    0.0
Radial Velocity                  1.0   52.0  475.0  424.0
Transit                          0.0    0.0   64.0  712.0
Transit Timing Variations        0.0    0.0    0.0    9.0

In [249]:
# pivot tables
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [250]:
titanic.groupby(['sex','class'])['survived'].aggregate('mean').unstack()

class      First    Second     Third
sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

In [251]:
titanic.pivot_table('survived',index='sex',columns='class')
# default aggfunc='mean'

class      First    Second     Third
sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

In [253]:
age = pd.cut(titanic['age'],[0,18,80]) # binning
titanic.pivot_table('survived',['sex',age],'class')

class               First    Second     Third
sex    age
female (0, 18]   0.909091  1.000000  0.511628
       (18, 80]  0.972973  0.900000  0.423729
male   (0, 18]   0.800000  0.600000  0.215686
       (18, 80]  0.375000  0.071429  0.133663

In [264]:
fare = pd.qcut(titanic['fare'],2)
titanic.pivot_table('survived',['sex',age],[fare,'class'])

fare            (-0.001, 14.454]                     (14.454, 512.329]  \
class                      First    Second     Third             First
sex    age
female (0, 18]               NaN  1.000000  0.714286          0.909091
       (18, 80]              NaN  0.880000  0.444444          0.972973
male   (0, 18]               NaN  0.000000  0.260870          0.800000
       (18, 80]              0.0  0.098039  0.125000          0.391304

fare
class              Second     Third
sex    age
female (0, 18]   1.000000  0.318182
       (18, 80]  0.914286  0.391304
male   (0, 18]   0.818182  0.178571
       (18, 80]  0.030303  0.192308

In [266]:
titanic.pivot_table(index='sex',columns='class',
                   aggfunc={'survived':sum,'fare':'mean'})

# the aggregation specification can be a string represent
# ing one of several common choices ('sum', 'mean', 'count', 'min'
# , 'max', etc.) or a function that implements an aggregation (np.sum()
# ,min(), sum(), etc.)

              fare                       survived
class        First     Second      Third    First Second Third
sex
female  106.125798  21.970121  16.118810       91     70    72
male     67.226127  19.741782  12.661633       45     17    47

In [267]:
#  compute totals along each grouping. 
titanic.pivot_table('survived',index='sex',columns='class',margins=True)

class      First    Second     Third       All
sex
female  0.968085  0.921053  0.500000  0.742038
male    0.368852  0.157407  0.135447  0.188908
All     0.629630  0.472826  0.242363  0.383838

In [268]:
# Birthrate dataset
# shell command to download the data:
# !curl -O https://raw.githubusercontent.com/jakevdp/data-CDCbirths/master/births.csv

  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current
                                 Dload  Upload   Total   Spent    Left  Speed
100  258k  100  258k    0     0   159k      0  0:00:01  0:00:01 --:--:--  159k

In [269]:
births = pd.read_csv('births.csv')

In [270]:
births.head()

   year  month  day gender  births
0  1969      1  1.0      F    4046
1  1969      1  1.0      M    4440
2  1969      1  2.0      F    4454
3  1969      1  2.0      M    4548
4  1969      1  3.0      F    4548